In [20]:
import pandas as pd

exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],

'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],

'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],

'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes'],
'labels' :['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']}


data = pd.DataFrame(exam_data)
data.to_csv('Data.csv')
new_data=pd.read_csv('Data.csv')
new_data.head()

   Unnamed: 0       name  score  attempts qualify labels
0           0  Anastasia   12.5         1     yes      a
1           1       Dima    9.0         3      no      b
2           2  Katherine   16.5         2     yes      c
3           3      James    NaN         3      no      d
4           4      Emily    9.0         2      no      e

In [22]:
import pandas as pd

exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],

'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],

'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],

'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes'],
'labels' :['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']}


data = pd.DataFrame(exam_data)
data.to_csv('Data.csv')
c=pd.read_csv('Data.csv')
new_data.head(3)

   Unnamed: 0       name  score  attempts qualify labels
0           0  Anastasia   12.5         1     yes      a
1           1       Dima    9.0         3      no      b
2           2  Katherine   16.5         2     yes      c

In [25]:
new_data= new_data.drop(new_data.index[3])
new_data.head()

   Unnamed: 0       name  score  attempts qualify labels
0           0  Anastasia   12.5         1     yes      a
1           1       Dima    9.0         3      no      b
2           2  Katherine   16.5         2     yes      c
4           4      Emily    9.0         2      no      e
5           5    Michael   20.0         3     yes      f

In [26]:
new_data.head()

   Unnamed: 0       name  score  attempts qualify labels
0           0  Anastasia   12.5         1     yes      a
1           1       Dima    9.0         3      no      b
2           2  Katherine   16.5         2     yes      c
4           4      Emily    9.0         2      no      e
5           5    Michael   20.0         3     yes      f

In [27]:
new_data.columns

Index(['Unnamed: 0', 'name', 'score', 'attempts', 'qualify', 'labels'], dtype='object')

In [28]:
new_data.name

0    Anastasia
1         Dima
2    Katherine
4        Emily
5      Michael
6      Matthew
7        Laura
8        Kevin
9        Jonas
Name: name, dtype: object

In [29]:
new_data.score

0    12.5
1     9.0
2    16.5
4     9.0
5    20.0
6    14.5
7     NaN
8     8.0
9    19.0
Name: score, dtype: float64

In [36]:
new_row= DataFrame(name: "Suresh", score: 15.5, attempts: 1, qualify: "yes")
new_row

SyntaxError: invalid syntax (2509373516.py, line 1)